{
    "version": "1.0",
    "lastUpdated": "2025-12-12",
    "items": [
        {
            "id": "modern-minimalist-living-001",
            "title": "Ethereal Calm: Modern Minimalist Living",
            "shortDescription": "A serene living space defined by clean lines, neutral tones, and a focus on essential forms.",
            "fullDescription": "This modern minimalist living room exemplifies the 'less is more' philosophy, creating a sanctuary of calm in a busy world. The design relies on a monochromatic palette of soft whites, creams, and pale greys, allowing light to become a primary design element. Furniture is low-profile and unadorned, emphasizing function and open space.\n\nSculptures play a vital role here, acting as focal points that break the visual silence without adding clutter. An abstract metal piece or a smooth, geometric stone form introduces texture and intellectual interest. The absence of excess decoration allows these carefully chosen artworks to breathe and command attention.\n\nTo achieve this look, focus on decluttering and selecting high-quality materials like matte finishes, natural linen, and honed stone. Keep window treatments simple to maximize natural light, and use lighting to highlight architectural features and art pieces.",
            "rating": 4.8,
            "tags": [
                "modern",
                "minimalist",
                "clean lines",
                "neutral tones",
                "contemporary",
                "serene"
            ],
            "sculptureType": "Bronze",
            "roomType": [
                "Living Room"
            ],
            "style": [
                "Modern Minimalist"
            ],
            "googleDriveId": "PLACEHOLDER_ID_1",
            "imageAlt": "Modern minimalist living room with abstract sculpture",
            "dimensions": "Variable",
            "price": "Inquire",
            "publishedDate": "2024-01-10",
            "relatedItemIds": [
                "scandinavian-bright-004",
                "zen-japanese-008",
                "contemporary-art-003"
            ]
        },
        {
            "id": "rustic-warm-study-002",
            "title": "The Scholar's Retreat: Rustic Warm Study",
            "shortDescription": "A cozy, intellectual haven featuring rich woods, warm leather, and timeless rustic charm.",
            "fullDescription": "This rustic study is designed as a retreat for contemplation and creativity. Dominated by warm, earthy tones and natural textures, the space feels grounded and secure. Exposed wooden beams, reclaimed timber bookshelves, and worn leather armchairs create an atmosphere of history and comfort.\n\nIn such a setting, figurative sculptures in wood or bronze feel right at home. A hand-carved wooden bust or a classical bronze figure adds a layer of narrative and tradition. These pieces complement the tactile nature of the room, inviting touch and close inspection.\n\nAchieve this aesthetic by layering textures—think wool throws, antique rugs, and raw wood surfaces. Lighting should be warm and localized, using brass or copper fixtures to enhance the cozy ambiance. Incorporate personal artifacts and books to give the space a lived-in, authentic soul.",
            "rating": 4.6,
            "tags": [
                "rustic",
                "warm",
                "study",
                "wood",
                "leather",
                "traditional"
            ],
            "sculptureType": "Wood",
            "roomType": [
                "Study",
                "Office"
            ],
            "style": [
                "Rustic",
                "Traditional"
            ],
            "googleDriveId": "PLACEHOLDER_ID_2",
            "imageAlt": "Rustic study with wooden shelves and bronze sculpture",
            "dimensions": "Variable",
            "price": "Inquire",
            "publishedDate": "2024-01-15",
            "relatedItemIds": [
                "classic-elegant-foyer-006",
                "transitional-comfort-012",
                "industrial-loft-005"
            ]
        },
        {
            "id": "contemporary-art-003",
            "title": "Curated Vision: Contemporary Art Gallery",
            "shortDescription": "A bold, gallery-inspired space designed to showcase avant-garde art and sculpture.",
            "fullDescription": "This space blurs the line between a home and an art gallery. With stark white walls, polished concrete floors, and track lighting, the architecture serves as a canvas for bold artistic expression. The furniture is sculptural in itself, often featuring unconventional shapes and vibrant colors.\n\nSculptures are the stars of this environment. Large-scale abstract pieces, mixed media installations, or kinetic sculptures find their perfect habitat here. The open layout allows for 360-degree viewing, encouraging interaction with the art from every angle.\n\nTo replicate this style, prioritize open floor plans and neutral backdrops. Invest in professional-grade lighting to properly illuminate art. Be fearless with color in your art choices, but keep the architectural shell simple to avoid visual competition.",
            "rating": 4.9,
            "tags": [
                "contemporary",
                "art",
                "gallery",
                "bold",
                "avant-garde",
                "colorful"
            ],
            "sculptureType": "Mixed Media",
            "roomType": [
                "Gallery Space",
                "Living Room"
            ],
            "style": [
                "Contemporary",
                "Abstract"
            ],
            "googleDriveId": "PLACEHOLDER_ID_3",
            "imageAlt": "Contemporary gallery space with large abstract sculpture",
            "dimensions": "Variable",
            "price": "Inquire",
            "publishedDate": "2024-02-01",
            "relatedItemIds": [
                "modern-minimalist-living-001",
                "urban-contemporary-013",
                "abstract-bronze-005"
            ]
        },
        {
            "id": "scandinavian-bright-004",
            "title": "Nordic Light: Scandinavian Bright Interior",
            "shortDescription": "A bright, airy space maximizing natural light with functional design and cozy textiles.",
            "fullDescription": "Embodying the principles of Hygge, this Scandinavian interior balances functionality with coziness. The palette is dominated by whites and light woods like ash or birch, ensuring the space feels bright even on dark days. Pops of color are introduced through textiles or plants, keeping the overall look fresh and airy.\n\nSculptural elements in this style are often organic and understated. Smooth, rounded forms in ceramic, light wood, or stone work best. They should feel approachable and soft, contributing to the overall sense of well-being and comfort.\n\nKey to this look is the maximization of natural light—keep windows unblocked. Use furniture with raised legs to maintain a sense of flow. Add warmth with sheepskin rugs, chunky knit throws, and plenty of candles.",
            "rating": 4.7,
            "tags": [
                "scandinavian",
                "nordic",
                "bright",
                "white",
                "wood",
                "hygge"
            ],
            "sculptureType": "Stone",
            "roomType": [
                "Living Room",
                "Bedroom"
            ],
            "style": [
                "Scandinavian",
                "Modern"
            ],
            "googleDriveId": "PLACEHOLDER_ID_4",
            "imageAlt": "Bright Scandinavian living room with organic stone sculpture",
            "dimensions": "Variable",
            "price": "Inquire",
            "publishedDate": "2024-02-10",
            "relatedItemIds": [
                "modern-minimalist-living-001",
                "zen-japanese-008",
                "coastal-mediterranean-009"
            ]
        },
        {
            "id": "industrial-loft-005",
            "title": "Urban Raw: Industrial Loft Design",
            "shortDescription": "A gritty yet sophisticated aesthetic celebrating raw materials like brick, metal, and concrete.",
            "fullDescription": "This industrial loft celebrates the beauty of imperfection and structural honesty. Exposed brick walls, concrete floors, and visible ductwork set the stage. The furniture often combines metal and distressed wood, having a sturdy, utilitarian feel.\n\nSculptures in an industrial setting can be substantial and rugged. Iron, steel, or recycled metal pieces with patina or rust finishes complement the raw architecture. Large-scale pieces hold their own against the visual weight of the building materials.\n\nTo get the industrial look, embrace the architectural bones of your space. Don't hide pipes or beams. Use a color palette of greys, blacks, and rust tones. Soften the edges with large area rugs and leather upholstery.",
            "rating": 4.5,
            "tags": [
                "industrial",
                "loft",
                "urban",
                "brick",
                "metal",
                "raw"
            ],
            "sculptureType": "Metal",
            "roomType": [
                "Living Room",
                "Dining Room"
            ],
            "style": [
                "Industrial",
                "Modern"
            ],
            "googleDriveId": "PLACEHOLDER_ID_5",
            "imageAlt": "Industrial loft with exposed brick and metal sculpture",
            "dimensions": "Variable",
            "price": "Inquire",
            "publishedDate": "2024-02-20",
            "relatedItemIds": [
                "rustic-warm-study-002",
                "urban-contemporary-013",
                "contemporary-art-003"
            ]
        },
        {
            "id": "classic-elegant-foyer-006",
            "title": "Timeless Grandeur: Classic Elegant Foyer",
            "shortDescription": "A sophisticated entryway featuring symmetry, rich details, and a sense of arrival.",
            "fullDescription": "First impressions matter, and this classic foyer makes a statement of elegance and tradition. Symmetry is key, with matching console tables, lamps, or mirrors creating a balanced composition. The materials are luxurious—marble floors, silk wallpapers, and crystal chandeliers.\n\nA classical figurative sculpture, perhaps a marble bust or a bronze figure on a pedestal, serves as the perfect centerpiece. It anchors the space and establishes a tone of refined taste and appreciation for history.\n\nCreate this style by focusing on symmetry and scale. Use moldings and wainscoting to add architectural interest. Choose a rich, sophisticated color palette and invest in one or two statement pieces, like a grand mirror or a significant sculpture.",
            "rating": 4.8,
            "tags": [
                "classic",
                "elegant",
                "foyer",
                "luxury",
                "traditional",
                "symmetry"
            ],
            "sculptureType": "Marble",
            "roomType": [
                "Foyer",
                "Entrance"
            ],
            "style": [
                "Classic",
                "Traditional"
            ],
            "googleDriveId": "PLACEHOLDER_ID_6",
            "imageAlt": "Elegant foyer with marble floor and classical bust sculpture",
            "dimensions": "Variable",
            "price": "Inquire",
            "publishedDate": "2024-03-01",
            "relatedItemIds": [
                "art-deco-glamour-010",
                "transitional-comfort-012",
                "rustic-warm-study-002"
            ]
        },
        {
            "id": "bohemian-eclectic-007",
            "title": "Global Soul: Bohemian Eclectic Living",
            "shortDescription": "A vibrant, layered space telling stories through global patterns, plants, and collected art.",
            "fullDescription": "The bohemian eclectic style is a curated mix of cultures, eras, and colors. It's a rule-breaking aesthetic that feels personal and traveled. Layered rugs, patterned textiles, and an abundance of indoor plants create a lush, inviting atmosphere.\n\nSculptures here are diverse and often handcrafted. Tribal masks, carved wooden totems, or brass deities fit perfectly into the mix. The key is that each piece should feel like a souvenir from a journey or a discovered treasure.\n\nTo achieve this, don't be afraid to mix patterns and colors. Layer rugs on top of each other. Display collections of objects rather than single pieces. Incorporate plenty of greenery to bring life to the space.",
            "rating": 4.4,
            "tags": [
                "bohemian",
                "eclectic",
                "global",
                "colorful",
                "plants",
                "layered"
            ],
            "sculptureType": "Wood",
            "roomType": [
                "Living Room",
                "Bedroom"
            ],
            "style": [
                "Bohemian",
                "Eclectic"
            ],
            "googleDriveId": "PLACEHOLDER_ID_7",
            "imageAlt": "Bohemian living room with plants and tribal sculptures",
            "dimensions": "Variable",
            "price": "Inquire",
            "publishedDate": "2024-03-10",
            "relatedItemIds": [
                "rustic-warm-study-002",
                "coastal-mediterranean-009",
                "mid-century-modern-011"
            ]
        },
        {
            "id": "zen-japanese-008",
            "title": "Mindful Balance: Zen Japanese Inspired",
            "shortDescription": "A minimalist retreat focused on nature, balance, and the beauty of emptiness.",
            "fullDescription": "Drawing from traditional Japanese aesthetics, this style emphasizes harmony between the natural and the man-made. Low furniture, sliding screens (shoji), and natural materials like bamboo and tatami are hallmarks. The space is uncluttered, promoting a meditative state of mind.\n\nSculptures in a Zen space are subtle and contemplative. A simple stone arrangement, a bronze bell, or a calligraphy scroll are appropriate. The placement is intentional, often in a tokonoma (alcove), inviting quiet reflection.\n\nFocus on horizontal lines and low furniture to ground the space. Use a palette of earth tones, greens, and bamboo. Eliminate clutter ruthlessly—every object should have a purpose or significant beauty.",
            "rating": 4.9,
            "tags": [
                "zen",
                "japanese",
                "minimalist",
                "nature",
                "balance",
                "peaceful"
            ],
            "sculptureType": "Stone",
            "roomType": [
                "Meditation Room",
                "Bedroom",
                "Garden"
            ],
            "style": [
                "Japanese",
                "Zen"
            ],
            "googleDriveId": "PLACEHOLDER_ID_8",
            "imageAlt": "Zen inspired room with low furniture and stone sculpture",
            "dimensions": "Variable",
            "price": "Inquire",
            "publishedDate": "2024-03-15",
            "relatedItemIds": [
                "modern-minimalist-living-001",
                "scandinavian-bright-004",
                "stone-buddha-004"
            ]
        },
        {
            "id": "coastal-mediterranean-009",
            "title": "Azure Breeze: Coastal Mediterranean",
            "shortDescription": "A relaxed, sun-drenched style featuring whites, blues, and natural terracotta textures.",
            "fullDescription": "Inspired by the coasts of Greece, Italy, and Spain, this style brings the vacation vibe home. White-washed walls, blue accents, and terracotta tiles create a cool, refreshing atmosphere. The furniture is often rustic wood or wrought iron, comfortable and unpretentious.\n\nSculptures that evoke antiquity work beautifully here—think fragments of classical columns, terracotta urns, or busts with a weathered finish. They connect the space to the rich history of the Mediterranean region.\n\nUse a palette of crisp white and various shades of blue. Incorporate natural textures like rattan, linen, and clay. Keep the layout open to encourage air flow and a relaxed lifestyle.",
            "rating": 4.6,
            "tags": [
                "coastal",
                "mediterranean",
                "blue",
                "white",
                "rustic",
                "relaxed"
            ],
            "sculptureType": "Terracotta",
            "roomType": [
                "Living Room",
                "Patio",
                "Dining Room"
            ],
            "style": [
                "Coastal",
                "Mediterranean"
            ],
            "googleDriveId": "PLACEHOLDER_ID_9",
            "imageAlt": "Mediterranean living room with white walls and terracotta sculpture",
            "dimensions": "Variable",
            "price": "Inquire",
            "publishedDate": "2024-03-20",
            "relatedItemIds": [
                "rustic-warm-study-002",
                "scandinavian-bright-004",
                "classic-elegant-foyer-006"
            ]
        },
        {
            "id": "art-deco-glamour-010",
            "title": "Gilded Age: Art Deco Glamour",
            "shortDescription": "A luxurious style defined by geometric shapes, metallic accents, and bold contrast.",
            "fullDescription": "Art Deco is all about opulence and drama. Geometric patterns, zigzags, and sunburst motifs adorn wallpapers and fabrics. Materials are rich and shiny—lacquer, mirror, chrome, and velvet. The color palette often features black, gold, and jewel tones.\n\nSculptures are essential to this look. Sleek, stylized bronze figures, often depicting movement or animals, fit perfectly. The materials should be polished and reflective, adding to the overall sense of luxury and modernity.\n\nTo achieve Art Deco glamour, incorporate mirrored furniture and metallic finishes. Use bold geometric wallpapers. Lighting should be statement jewelry for the room—think chandeliers with glass rods or geometric sconces.",
            "rating": 4.7,
            "tags": [
                "art deco",
                "glamour",
                "luxury",
                "geometric",
                "gold",
                "bold"
            ],
            "sculptureType": "Bronze",
            "roomType": [
                "Living Room",
                "Dining Room",
                "Bar"
            ],
            "style": [
                "Art Deco",
                "Glamour"
            ],
            "googleDriveId": "PLACEHOLDER_ID_10",
            "imageAlt": "Art Deco living room with geometric patterns and bronze sculpture",
            "dimensions": "Variable",
            "price": "Inquire",
            "publishedDate": "2024-04-01",
            "relatedItemIds": [
                "classic-elegant-foyer-006",
                "contemporary-art-003",
                "mid-century-modern-011"
            ]
        },
        {
            "id": "mid-century-modern-011",
            "title": "Retro Future: Mid-Century Modern",
            "shortDescription": "A functional, organic style from the mid-20th century featuring teak wood and iconic shapes.",
            "fullDescription": "Mid-Century Modern (MCM) is characterized by clean lines, organic curves, and a seamless flow between indoors and outdoors. Teak and walnut woods are staples, often paired with vibrant colors like mustard yellow, olive green, or teal. Furniture legs are tapered, giving pieces a lightweight appearance.\n\nSculptures in MCM interiors are often abstract and organic, echoing the shapes of the furniture. Mobiles, wire sculptures, or biomorphic forms in wood or stone complement the aesthetic without overwhelming it.\n\nFocus on furniture with clean lines and tapered legs. Use a mix of traditional materials (wood) and non-traditional ones (plastic, vinyl). Keep the layout open and functional.",
            "rating": 4.8,
            "tags": [
                "mid-century modern",
                "retro",
                "vintage",
                "teak",
                "organic",
                "functional"
            ],
            "sculptureType": "Mixed Media",
            "roomType": [
                "Living Room",
                "Study"
            ],
            "style": [
                "Mid-Century Modern",
                "Retro"
            ],
            "googleDriveId": "PLACEHOLDER_ID_11",
            "imageAlt": "Mid-century modern room with teak furniture and abstract sculpture",
            "dimensions": "Variable",
            "price": "Inquire",
            "publishedDate": "2024-04-10",
            "relatedItemIds": [
                "scandinavian-bright-004",
                "bohemian-eclectic-007",
                "contemporary-art-003"
            ]
        },
        {
            "id": "transitional-comfort-012",
            "title": "Harmonious Blend: Transitional Comfort",
            "shortDescription": "A balanced mix of traditional and modern elements creating a timeless, comfortable home.",
            "fullDescription": "Transitional style bridges the gap between traditional and modern. It takes the warmth and comfort of traditional design and cleans up the lines for a more contemporary feel. The result is a sophisticated, timeless space that feels inviting. Colors are typically neutral—taupe, tan, and vanilla.\n\nSculptures here serve as bridges between styles. A classic subject rendered in a modern material, or a simple modern form in a traditional material like marble, works well. The art should be elegant and understated.\n\nMix furniture styles—pair a traditional sofa with a modern coffee table. Keep the color palette neutral and monochromatic. Use texture (chenille, suede, leather) to add interest instead of bold patterns.",
            "rating": 4.5,
            "tags": [
                "transitional",
                "comfortable",
                "timeless",
                "neutral",
                "balanced",
                "elegant"
            ],
            "sculptureType": "Marble",
            "roomType": [
                "Living Room",
                "Bedroom"
            ],
            "style": [
                "Transitional",
                "Classic"
            ],
            "googleDriveId": "PLACEHOLDER_ID_12",
            "imageAlt": "Transitional living room with neutral tones and marble sculpture",
            "dimensions": "Variable",
            "price": "Inquire",
            "publishedDate": "2024-04-15",
            "relatedItemIds": [
                "classic-elegant-foyer-006",
                "rustic-warm-study-002",
                "modern-minimalist-living-001"
            ]
        },
        {
            "id": "urban-contemporary-013",
            "title": "City Slick: Urban Contemporary",
            "shortDescription": "A cosmopolitan style featuring sleek surfaces, cool tones, and a touch of luxury.",
            "fullDescription": "Urban contemporary design is sophisticated and cosmopolitan. It often features a cool color palette of greys, blacks, and whites, softened by luxurious fabrics like velvet. Surfaces are sleek—glass, polished metal, and lacquer. The vibe is chic and polished.\n\nSculptures are often statement pieces—large, bold, and perhaps a bit edgy. Metallic finishes or high-gloss materials fit the urban aesthetic. They act as conversation starters and focal points in the room.\n\nTo get this look, keep the background neutral and cool. Invest in large-scale furniture with clean lines. Add softness with plush rugs and pillows. Use lighting to create drama and mood.",
            "rating": 4.7,
            "tags": [
                "urban",
                "contemporary",
                "sleek",
                "city",
                "luxury",
                "cool"
            ],
            "sculptureType": "Metal",
            "roomType": [
                "Living Room",
                "Apartment"
            ],
            "style": [
                "Urban",
                "Contemporary"
            ],
            "googleDriveId": "PLACEHOLDER_ID_13",
            "imageAlt": "Urban contemporary apartment with sleek furniture and metal sculpture",
            "dimensions": "Variable",
            "price": "Inquire",
            "publishedDate": "2024-04-20",
            "relatedItemIds": [
                "contemporary-art-003",
                "industrial-loft-005",
                "modern-minimalist-living-001"
            ]
        }
    ]
}